cook_book = [
    ['салат',
     [
         ['картофель', 100, 'гр.'],
         ['морковь', 50, 'гр.'],
         ['огурцы', 50, 'гр.'],
         ['горошек', 30, 'гр.'],
         ['майонез', 70, 'мл.'],
     ]
     ],
    ['пицца',
     [
         ['сыр', 50, 'гр.'],
         ['томаты', 50, 'гр.'],
         ['тесто', 100, 'гр.'],
         ['бекон', 30, 'гр.'],
         ['колбаса', 30, 'гр.'],
         ['грибы', 20, 'гр.'],
     ],
     ],
    ['фруктовый десерт',
     [
         ['хурма', 60, 'гр.'],
         ['киви', 60, 'гр.'],
         ['творог', 60, 'гр.'],
         ['сахар', 10, 'гр.'],
         ['мед', 50, 'мл.'],
     ]
     ]
]

person = int(input("Введите количество персон, для которых будем готовить: "))

for x in range(len(cook_book)):
    for i in range(len(cook_book[x])):
        if i == 0:
            print(cook_book[x][i].capitalize() + ':')
        for n in range(len(cook_book[x][i])):
            if i != 0:
                cook_book[x][i][n][1] = cook_book[x][i][n][1] * person
                print(*cook_book[x][i][n])
                if n == len(cook_book[x][i]):
                    print("\n")